Tekla Open API Reference for Tekla Structures 2025
StringList Class
 The StringList class defines a type safe string collection.
Inheritance Hierarchy
System.Object
 System.Collections.CollectionBase
 Tekla.Structures.Drawing.StringList
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class StringList : CollectionBase
<SerializableAttribute>
Public NotInheritable Class StringList
	Inherits CollectionBase
The StringList type exposes the following members.
Constructors
Name | Description
StringList()
 Creates a new string list instance.
StringList(Int32)
 Creates a new string list instance with the given capacity.
Top
Properties
Name | Description
Item
 Gets or sets the string at the specified index.
Top
Methods
Name | Description
Add
 Adds a new string to the end of the string list.
Contains
 Checks if the string is in the list.
GetRange
 Gets a part of the string list.
IndexOf(String)
 Gets the index of the specified string.
IndexOf(String, Int32)
 Gets the index of the specified string between the index to start the search from and the end of the list.
IndexOf(String, Int32, Int32)
 Gets the index of the specified string between the index to start the search from and startIndex + count.
Insert
 Inserts the string to the specified index.
IsEqual
 Compares the current object with an object of the same type.
LastIndexOf(String)
 Searches for the last occurence of the string in the list.
LastIndexOf(String, Int32)
 Searches for the last occurence of the string in the list.
LastIndexOf(String, Int32, Int32)
 Searches for the last occurence of the string in the list.
Remove
 Removes the first occurence of the string from the list.
RemoveRange
 Removes a range of items starting from the given index.
ToArray
 Copies the strings to a string array.
Top
Examples
using Tekla.Structures.Drawing;
public class Example
{
       public void Example1()
       {
           StringList stringList = new StringList();
           stringList.Add("MyString");
           stringList.Add("MySecondString");
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace